import { atom } from "nanostores";

export const alert = atom<AlertState>({
	activeRegion: "Київська область",
	regions: [
		"Чернігівська область",
		"Київська область",
		"Херсонська область",
		"Херсонська область",
		"Львівська область",
		"Чернівецька область",
		"Полтавська область",
		"Миколаївська область",
		"Хмельницька область",
		"Тернопільська область",
		"Житомирська область",
		"Івано-Франківська область",
		"Чернігівська область",
		"Волинська область",
		"Донецька область",
		"Одеська область",
		"Вінницька область",
		"Дніпропетровська область",
		"Сумська область",
		"Закарпатська область",
		"Рівненська область",
		"Харківська область",
		"Кіровоградська область",
		"Черкаська область",
		"Запорізька область",
		"Луганська область",
		"Автономна Республіка Крим",
		"Миколаївська область",
		"Дніпропетровська область",
		"Миколаївська область",
		"Дніпропетровська область",
		"Кіровоградська область",
		"Одеська область",
	],
	refreshRate: 20,
});

export function setActiveRegion(region: string): void {
	alert.set({
		...alert.get(),
		activeRegion: region,
	});
}

export function setRefreshRate(rate: number): void {
	alert.set({
		...alert.get(),
		refreshRate: rate,
	});
}

export type AlertState = {
	activeRegion: string;
	regions: string[];
	refreshRate: number;
};
